src/Reports/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="597c2980-a5f1-4f8e-af99-86d86f9c2fec">
  <name>Продажи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9a98b6a3-eb43-4a30-8076-b8a790e9ac9d">
    <name>КонецПериода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="439703df-aa60-401f-ae85-d1db334dc373">
    <name>НачалоПериода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56991a12-f56b-4090-921c-383ee972b92f">
    <name>Периодичность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="42e7dfae-04eb-4a30-8af3-7f6e93467182">
    <name>ПоказательКоличество</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоказательНаценкаСрезЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательПроцентНаценкиСрезЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательСебестоимостьСрезЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="a12cfc70-38fd-4121-88c3-1ddcea25bcf4">
    <name>ПоказательСумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоказательЦенаЗакупочнаяСрезЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательЦенаПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="499448bd-f3f1-4a89-a027-1896b1fd421c">
    <name>РазмещениеДополнительныхПолей</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="b907067c-3dbf-4ca1-9092-9bf8f735fef2">
    <name>Группировка</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0fefc99f-29c1-43a9-a781-fecc37f0262f">
      <name>ТипГруппировки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>1</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4d10e86c-cbd0-418f-9f0c-9abce6c4c5d1">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b34412a2-c904-4e59-860d-d4b8e26fdc25">
      <name>Использование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="d272ba48-7f88-4475-9e0f-bb847b186bda">
    <name>ДополнительныеПоля</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c84e168a-dcf8-426c-8bcd-0c80a136d3f6">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c3ae35bc-aef7-41f1-b6df-0e35bdf38500">
      <name>Использование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Report>

src/Reports/Продажи/Forms/ФормаОтчета/Module.bsl
&Вместо("УстановитьНастройкиПоУмолчанию")
Процедура Базар_УстановитьНастройкиПоУмолчанию()
	
	БухгалтерскиеОтчетыВызовСервера.УстановитьНастройкиПоУмолчанию(ЭтотОбъект);

	Отчет.ПоказательСумма                 = Истина;
	Отчет.ПоказательКоличество            = Ложь;
	Отчет.ПоказательЦенаПродажи           = Ложь;
	Отчет.ПоказательСебестоимостьСрезЦен  = Ложь;
	Отчет.ПоказательНаценкаСрезЦен        = Истина;
	Отчет.ПоказательПроцентНаценкиСрезЦен = Истина;
	Отчет.ПоказательЦенаЗакупочнаяСрезЦен = Ложь;
	
	ЗаполнитьВыбранныеПоказателиПоДаннымИзОтчета();
	
КонецПроцедуры

&Вместо("ПодготовитьПараметрыОтчетаНаСервере")
Функция Базар_ПодготовитьПараметрыОтчетаНаСервере()
	
	МенеджерОтчета = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ЭтотОбъект.ИмяФормы);
	
	ПараметрыОтчета = МенеджерОтчета.ПустыеПараметрыКомпоновкиОтчета();
	
	ПараметрыОтчета.НачалоПериода                     = Отчет.НачалоПериода;
	ПараметрыОтчета.КонецПериода                      = Отчет.КонецПериода;
	ПараметрыОтчета.ПоказательСумма                   = Отчет.ПоказательСумма;
	ПараметрыОтчета.ПоказательКоличество              = Отчет.ПоказательКоличество;
	ПараметрыОтчета.ПоказательНаценкаСрезЦен          = Отчет.ПоказательНаценкаСрезЦен;
	ПараметрыОтчета.ПоказательПроцентНаценкиСрезЦен   = Отчет.ПоказательПроцентНаценкиСрезЦен;
	ПараметрыОтчета.ПоказательСебестоимостьСрезЦен    = Отчет.ПоказательСебестоимостьСрезЦен;
	ПараметрыОтчета.ПоказательЦенаЗакупочнаяСрезЦен   = Отчет.ПоказательЦенаЗакупочнаяСрезЦен;
	ПараметрыОтчета.ПоказательЦенаПродажи             = Отчет.ПоказательЦенаПродажи;
	ПараметрыОтчета.Организация                       = Отчет.Организация;
	ПараметрыОтчета.ВключатьОбособленныеПодразделения = Отчет.ВключатьОбособленныеПодразделения;
	ПараметрыОтчета.Периодичность                     = Отчет.Периодичность;
	ПараметрыОтчета.РазмещениеДополнительныхПолей     = Отчет.РазмещениеДополнительныхПолей;
	ПараметрыОтчета.Группировка                       = Отчет.Группировка.Выгрузить();
	ПараметрыОтчета.ДополнительныеПоля                = Отчет.ДополнительныеПоля.Выгрузить();
	
	ПараметрыОтчета.ВыводитьДиаграмму                 = ВыводитьДиаграмму;
	ПараметрыОтчета.ВыводитьЗаголовок                 = ВыводитьЗаголовок;
	ПараметрыОтчета.ВыводитьПодвал                    = ВыводитьПодвал;
	ПараметрыОтчета.МакетОформления                   = МакетОформления;
	ПараметрыОтчета.РежимРасшифровки                  = Отчет.РежимРасшифровки;
	ПараметрыОтчета.ДанныеРасшифровки                 = ДанныеРасшифровки;
	ПараметрыОтчета.КлючТекущегоВарианта              = КлючТекущегоВарианта;
	ПараметрыОтчета.СхемаКомпоновкиДанных             = ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных);
	ПараметрыОтчета.ИдентификаторОтчета               = БухгалтерскиеОтчетыКлиентСервер.ПолучитьИдентификаторОбъекта(ЭтотОбъект);
	ПараметрыОтчета.НастройкиКомпоновкиДанных         = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	ПараметрыОтчета.ВыбранныеПоказатели               = МассивВыбранныеПоказатели();
	
	ПараметрыОтчета.Вставить("ПоказательОпределятьСуммуПоОплате", КлючТекущегоВарианта = "ПродажиПоКонтрагентамПоОплате");
	
	Возврат ПараметрыОтчета;
	
КонецФункции

&Вместо("ИнициализироватьКомпоновщикаНастроек")
Процедура Базар_ИнициализироватьКомпоновщикаНастроек()
	
	//БухгалтерскиеОтчетыВызовСервера.ИнициализацияКомпоновщикаНастроек(ЭтотОбъект, Истина, КлючТекущегоВарианта);
	
	КомпоновщикИнициализирован = Истина;
	
	Элементы.НастройкиОтчета.Видимость = Истина;
	
	ИмяОтчета = БухгалтерскиеОтчеты.ИмяОтчета(ЭтаФорма);
	
	Схема = Отчеты[ИмяОтчета].ПолучитьМакет("Базар_СхемаКомпоновкиДанных");
	
	Если ПустаяСтрока(КлючТекущегоВарианта) Тогда
		КлючТекущегоВарианта = ИмяОтчета;
	КонецЕсли;
	
	ВариантНастроек = Схема.ВариантыНастроек.Найти(КлючТекущегоВарианта);
	
	Если ВариантНастроек <> Неопределено Тогда
		Настройки = ВариантНастроек.Настройки;
	Иначе
		Настройки = Схема.НастройкиПоУмолчанию;
	КонецЕсли;
	
	СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
	Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	ТекущиеПользовательскиеНастройки = Неопределено;
	
	Если ЭтоАдресВременногоХранилища(ПользовательскиеНастройки) Тогда
		ТекущиеПользовательскиеНастройки = ПолучитьИзВременногоХранилища(ПользовательскиеНастройки);
	КонецЕсли;
	
	БухгалтерскиеОтчетыВызовСервера.ПриЗагрузкеПользовательскихНастроекКомпоновщикаНаСервере(ЭтаФорма, ТекущиеПользовательскиеНастройки);
	
	БухгалтерскиеОтчетыКлиентСервер.ОрганизацияПриИзменении(ЭтаФорма, Отчет.Организация);
	
	БухгалтерскиеОтчетыВызовСервера.ОбновитьОписаниеОтборовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Базар_СформироватьОтчетПеред(Команда)
	
	Для Каждого ЭлементСписка из ВыбранныеПоказатели цикл
		Отчет["Показатель" + ЭлементСписка.Значение] = ЭлементСписка.Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Базар_ПриОткрытииПосле(Отказ)
	
	ЗаполнитьВыбранныеПоказателиПоДаннымИзОтчета();
	
КонецПроцедуры

&НаСервере
Функция МассивВыбранныеПоказатели()
	
	МассивВыбранныхПоказателей = Новый Массив;
	Для Каждого ЭлементСписка из ВыбранныеПоказатели цикл
		Если НЕ ЭлементСписка.Пометка тогда
			Продолжить;
		КонецЕсли;
		МассивВыбранныхПоказателей.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	
	Возврат МассивВыбранныхПоказателей;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВыбранныеПоказателиПоДаннымИзОтчета()
	
	Если ВыбранныеПоказатели.Количество() = 0 тогда
		ВыбранныеПоказатели.Добавить("Количество", "Количество (продано)", Отчет.ПоказательКоличество);
		ВыбранныеПоказатели.Добавить("Сумма", "Сумма (продано)", Отчет.ПоказательСумма);
		ВыбранныеПоказатели.Добавить("ЦенаПродажи", "Цена продажи (сумма / количество)", Отчет.ПоказательЦенаПродажи);
		ВыбранныеПоказатели.Добавить("НаценкаСрезЦен", "Наценка (по ценам номенклатуры)", Отчет.ПоказательНаценкаСрезЦен);
		ВыбранныеПоказатели.Добавить("СебестоимостьСрезЦен", "Себестоимость (по ценам номенклатуры)", Отчет.ПоказательСебестоимостьСрезЦен);
		ВыбранныеПоказатели.Добавить("ЦенаЗакупочнаяСрезЦен", "Цена закупочная (по ценам номенклатуры)", Отчет.ПоказательЦенаЗакупочнаяСрезЦен);
		ВыбранныеПоказатели.Добавить("ПроцентНаценкиСрезЦен", "% наценки (по ценам номенклатуры)", Отчет.ПоказательПроцентНаценкиСрезЦен);
	КонецЕсли;
	
КонецПроцедуры
